Repository: timlapov/CartesDeMots
Catalog: CartesDeMots/*.lproj/Localizable.strings
Languages: fr, ru

# tab_words
source: Words
fr: Mots
ru: Слова

# tab_learn
source: Training
fr: Apprentissage
ru: Тренировка

# tab_resources
source: Resources
fr: Ressources
ru: Ресурсы

# tab_settings
source: Settings
fr: Paramètres
ru: Настройки

source: Comment
fr: Commentaire
ru: Комментарий

source: Swipe to delete
fr: Glissez pour supprimer
ru: Провести, чтобы удалить

source: Your list of words
fr: Votre liste de mots
ru: Список слов

source: New word
fr: Nouveau mot
ru: Новое слово

# Foreign word
source: Foreign word (invisible side)
fr: Mot étranger (côté invisible)
ru: Иностранное слово (невидимая сторона)

# Translation
source: Translation (visible side)
fr: Traduction (côté visible)
ru: Перевод (видимая сторона)

source: Add the word
fr: Ajouter le mot
ru: Добавить слово

source: Complexity %d
fr: Complexité %d
ru: Сложность %d

source: Show word
fr: Afficher le mot
ru: Показать слово

source: Easy
fr: Facile
ru: Легко

source: Hard
fr: Difficile
ru: Сложно

source: No words available for learning
fr: Aucun mot disponible pour l'apprentissage
ru: Нет слов для изучения

source: Useful links
fr: Liens utiles
ru: Полезные ссылки

source: New resource link
fr: Nouveau lien de ressource
ru: Новая ссылка на ресурс

source: Title
fr: Titre
ru: Заголовок

source: Link
fr: Lien
ru: Ссылка

source: Add the link
fr: Ajouter le lien
ru: Добавить ссылку

source: More Apps
fr: Autres apps

source: Settings
fr: Réglages
ru: Настройки

source: Language
fr: Langue
ru: Язык

source: Enter language (emoji or name)
fr: Entrez la langue (emoji ou nom)
ru: Введите язык (эмодзи или название)

source: Startup Page
fr: Page de démarrage
ru: Стартовая страница

source: How to Use
fr: Guide d'utilisation

# how_to_alert_text
source: Swipe to delete All words sync between devices and are saved after reinstalling the app if you log in to the same iCloud account Words initially have the same rating, but it changes depending on whether the word is easy or difficult Easy words are shown less and less frequently, difficult ones - more often Words with zero rating are not shown
fr: Glissez pour supprimer Tous les mots se synchronisent entre les appareils et sont sauvegardés après la réinstallation de l'application si vous vous connectez au même compte iCloud Les mots ont initialement la même note, mais elle change selon que le mot est facile ou difficile Les mots faciles sont montrés de moins en moins fréquemment, les difficiles - plus souvent Les mots dont le classement est nul ne sont pas affichés
ru: Смахните для удаления Все слова синхронизируются между устройствами и сохраняются после переустановки приложения, если вы входите в тот же аккаунт iCloud Изначально все слова имеют одинаковый рейтинг, но он меняется в зависимости от того, легкое слово или сложное Легкие слова показываются все реже, сложные - чаще Слова с нулевым рейтингом не показываются

source: Got it
fr: J'ai compris
ru: Понятно

# Write to developer
source: Suggest an Idea
fr: Proposer une idée
ru: Предложить идею

source: Feedback
fr: Commentaires

source: Review on the App Store
fr: Évaluer sur l'App Store

source: General
fr: Général

source: System Settings
fr: Réglages système

source: Feedback for LexiSwipe app (v%@)
fr: Commentaires sur l'application LexiSwipe (v%@)

# emailBody
source: Hello, I'm writing from the LexiSwipe app. I want to report a bug: I want to suggest an idea:
fr: Bonjour, J'écris depuis l'application LexiSwipe. Je souhaite signaler un bug : Je souhaite suggérer une idée :
ru: Здравствуйте, Я пишу из приложения CartesDeMots. Я хочу сообщить об ошибке: Я хочу предложить идею:

# howto_cards_title
source: Words
fr: Mots
ru: Слова

# howto_cards_description
source: Add foreign words and their translations. Each card can include an optional comment for context or notes. iOS 26+: Tap on a card to reveal action buttons — delete, edit, or reset difficulty. iOS 18 and earlier: Swipe left on a card to delete it.
fr: Ajoutez des mots étrangers et leurs traductions. Chaque carte peut inclure un commentaire facultatif pour le contexte ou des notes. iOS 26+ : Appuyez sur une carte pour afficher les boutons d'action — supprimer, modifier ou réinitialiser la difficulté. iOS 18 et antérieur : Glissez vers la gauche sur une carte pour la supprimer.
ru: Добавляйте иностранные слова и их переводы. Каждая карточка может включать комментарий для контекста или заметок. iOS 26+: Нажмите на карточку, чтобы появились кнопки действий — удаление, редактирование или сброс сложности. iOS 18 и ранее: Смахните карточку влево для удаления.

# howto_learn_title
source: Training
fr: Apprentissage
ru: Тренировка

# howto_learn_description
source: Practice your vocabulary with flashcards. Tap to reveal the hidden word, then mark it as Easy or Hard — either by tapping the buttons or swiping the card left (Easy) or right (Hard).
fr: Entraînez votre vocabulaire avec des cartes mémoire. Appuyez pour révéler le mot caché, puis marquez-le comme Facile ou Difficile — soit en appuyant sur les boutons, soit en glissant la carte vers la gauche (Facile) ou la droite (Difficile).
ru: Тренируйте словарный запас с помощью карточек. Нажмите, чтобы показать скрытое слово, затем отметьте его как Легко или Сложно — нажав на кнопку или смахнув карточку влево (Легко) или вправо (Сложно).

# howto_resources_title
source: Resources
fr: Ressources
ru: Ресурсы

# howto_resources_description
source: Save useful links to language learning resources, dictionaries, or any helpful websites. iOS 26+: Tap on a link to reveal the delete button. iOS 18 and earlier: Swipe left to delete.
fr: Enregistrez des liens utiles vers des ressources d'apprentissage des langues, des dictionnaires ou tout autre site Web utile. iOS 26+ : Appuyez sur un lien pour afficher le bouton de suppression. iOS 18 et antérieur : Glissez vers la gauche pour supprimer.
ru: Сохраняйте полезные ссылки на ресурсы для изучения языков, словари или любые полезные сайты. iOS 26+: Нажмите на ссылку, чтобы появилась кнопка удаления. iOS 18 и ранее: Смахните влево для удаления.

# howto_gestures_title
source: iCloud Sync
fr: Synchronisation iCloud
ru: Синхронизация iCloud

# howto_gestures_description
source: Your data syncs automatically via iCloud across all your devices.
fr: Vos données se synchronisent automatiquement via iCloud sur tous vos appareils.
ru: Ваши данные автоматически синхронизируются через iCloud на всех ваших устройствах.

# howto_rating_title
source: Smart Rating System
fr: Système de notation intelligent
ru: Умная система рейтинга

# howto_rating_description
source: Words start with the same rating. Easy words appear less often, hard words appear more frequently. Words with zero rating are hidden from training. iOS 26+: You can reset a word's rating using the instructions above.
fr: Les mots commencent avec la même note. Les mots faciles apparaissent moins souvent, les mots difficiles plus fréquemment. Les mots avec une note nulle sont masqués de l'entraînement. iOS 26+ : Vous pouvez réinitialiser la note d'un mot en suivant les instructions ci-dessus.
ru: Слова начинают с одинакового рейтинга. Лёгкие слова появляются реже, сложные — чаще. Слова с нулевым рейтингом скрыты от тренировки. iOS 26+: Вы можете сбросить рейтинг слова по инструкции выше.

# search_prompt_title
source: Search for Words
fr: Rechercher des mots
ru: Поиск слов

# search_prompt_description
source: Enter a word, translation, or comment to search
fr: Entrez un mot, une traduction ou un commentaire pour rechercher
ru: Введите слово, перевод или комментарий для поиска
